# Dropping Entries form an Axis

Dropping one or more entries from an axis is easy if you have an index array or list without those entries. As that can require a bit of munging and set logic, the drop method will return a new object with the indicated value or values deleted from an axis:

In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [2]:
obj = Series(np.arange(6), index=['a', 'b', 'c', 'd', 'c', 'e'])
obj

a    0
b    1
c    2
d    3
c    4
e    5
dtype: int32

In [3]:
new_obj = obj.drop('c')

new_obj

a    0
b    1
d    3
e    5
dtype: int32

In [4]:
obj.drop(['d', 'c'])

a    0
b    1
e    5
dtype: int32

With DataFrame, index values can be deleted from either axis:

In [5]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                index=['Ohio', 'Colorado', 'Utah', 'New York'],
                columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [6]:
new_data = data.drop(['Colorado', 'Ohio'], axis = 0)

new_data

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

Axis 0 does not need to be define over all, but axis 1 should be define

In [7]:
new_data2 = data.drop('two', axis = 1)

new_data2

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [8]:
new_data3 = data.drop(['two', 'four'], axis = 1)

new_data3

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14